====================================
exec cics ignore condition
====================================
       identification division.
       program-id. a.
       procedure division.
           EXEC CICS
              IGNORE CONDITION ERROR
           END-EXEC.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (exec_cics_statement
        body: (cics_body
          command: (cics_command)))
      (period))))

====================================
exec cics return
====================================
       identification division.
       program-id. a.
       procedure division.
           EXEC CICS
              RETURN
           END-EXEC.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (exec_cics_statement
        body: (cics_body
          command: (cics_command)))
      (period))))

====================================
exec cics link
====================================
       identification division.
       program-id. a.
       procedure division.
           EXEC CICS
              LINK PROGRAM('TC2C1800')
                   COMMAREA(TCWC0200)
           END-EXEC.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (exec_cics_statement
        body: (cics_body
          command: (cics_command)
          (string)))
      (period))))

====================================
exec cics syncpoint inline
====================================
       identification division.
       program-id. a.
       procedure division.
           EXEC CICS SYNCPOINT
           END-EXEC.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (exec_cics_statement
        body: (cics_body
          command: (cics_command)))
      (period))))

====================================
exec sql stays sql
====================================
       identification division.
       program-id. a.
       procedure division.
           EXEC SQL
             SELECT CAMPO INTO :WS-CAMPO
             FROM TABLA
           END-EXEC.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (exec_sql_statement
        body: (sql_body
          (sql_host_variable
            name: (qualified_word
              (WORD)))))
      (period))))
