====================================
open input
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       open input f.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (open_statement
        (open_arg
          mode: (INPUT)
          file_name_list: (WORD)))
      (period))))

====================================
open output
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       open output f.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (open_statement
        (open_arg
          mode: (OUTPUT)
          file_name_list: (WORD)))
      (period))))

====================================
open i-o
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       open i-o f.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (open_statement
        (open_arg
          mode: (I_O)
          file_name_list: (WORD)))
      (period))))

====================================
open extend
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       open extend f.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (open_statement
        (open_arg
          mode: (EXTEND)
          file_name_list: (WORD)))
      (period))))

====================================
cobol400 file names in io statements
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       file-control.
       select FECA_SFP assign database-FECA_SFP.
       procedure division.
       open input FECA_SFP DCALEND_TP.
       read FECA_SFP.
       delete FECA_SFP.
       close FECA_SFP.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (cobol400_word)
          (assign_clause
            to: (database_assignment_name)))))
    (procedure_division
      (open_statement
        (open_arg
          mode: (INPUT)
          file_name_list: (cobol400_word)
          file_name_list: (cobol400_word)))
      (period)
      (read_statement
        file_name: (cobol400_word))
      (period)
      (delete_statement
        file_name: (cobol400_word))
      (period)
      (close_statement
        (close_arg
          file_handler: (cobol400_word)))
      (period))))

====================================
delete multiple file names
====================================
       identification division.
       program-id. a.
       procedure division.
       delete f1 f2.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (delete_statement
        file_name: (WORD)
        file_name: (WORD))
      (period))))

====================================
start split not less than
====================================
       identification division.
       program-id. a.
       procedure division.
       start f key is not
             less than externally-described-key.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (procedure_division
      (start_statement
        file_name: (WORD)
        (start_key
          op: (ge)
          keys: (qualified_word
            (WORD))))
      (period))))

====================================
close
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)))
      (period))))

====================================
close reel
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f reel.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (REEL))))
      (period))))

====================================
close unit
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f UNIT.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (UNIT))))
      (period))))

====================================
close unit removal
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f unit removal.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (UNIT)
            (REMOVAL))))
      (period))))

====================================
close unit for removal
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f unit for removal.
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (UNIT)
            (REMOVAL))))
      (period))))

====================================
close unit no rewind
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f no rewind. 
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (NO)
            (REWIND))))
      (period))))

====================================
close unit with no rewind
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f with no rewind. 
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (NO)
            (REWIND))))
      (period))))

====================================
close unit lock
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f lock. 
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (LOCK))))
      (period))))

====================================
close unit with lock
====================================
       identification division.
       program-id. a.
       environment division.
       input-output section.
       FILE-CONTROL.
       select f assign PRINTER.
       procedure division.
       close f with lock. 
---

(start
  (program_definition
    (identification_division
      (program_name))
    (environment_division
      (input_output_section
        (select_statement
          file_name: (WORD)
          (assign_clause
            to: (PRINTER)))))
    (procedure_division
      (close_statement
        (close_arg
          file_handler: (WORD)
          (close_option
            (LOCK))))
      (period))))
